In [2]:
import numpy as np
import pandas as pd

In [36]:
names = pd.Series(['andrew','bobo','claire','david','4'])

In [32]:
names

0    andrew
1      bobo
2    claire
3     david
4         4
dtype: object

In [6]:

names_2 = pd.Series(['andrew','bobo','claire','david',4])

In [7]:
names_2

0    andrew
1      bobo
2    claire
3     david
4         4
dtype: object

In [8]:
names.str.capitalize()

0    Andrew
1      Bobo
2    Claire
3     David
4         4
dtype: object

In [9]:
names_2.str.capitalize()

0    Andrew
1      Bobo
2    Claire
3     David
4       NaN
dtype: object

**ALL Mtds are same as str

In [20]:
names.str.capitalize().str[0]

0    A
1    B
2    C
3    D
4    4
dtype: object

In [27]:
names.str.count('4')

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [28]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [79]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']

In [80]:
data = pd.Series(tech_finance)

In [81]:
data

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [82]:
data.str.split(',')

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [83]:
data.str.split(',').str[0]

0    GOOG
1     JPM
dtype: object

In [84]:
data.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [85]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])

In [63]:
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [55]:
messy_names.str.replace(';','').str.strip()

0    andrew
1      bobo
2    claire
dtype: object

In [59]:
messy_names.str.replace(';','').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [66]:
def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name

In [67]:
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [68]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

In [72]:
pd.Series(np.vectorize(cleanup)(messy_names))

0    Andrew
1      Bobo
2    Claire
dtype: object